[
    {
        "id": "0",
        "dua": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
        "translation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.",
        "reference": "Surah Al-Naml (27:19)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3178.mp3"
        ]
    },
    {
        "id": "1",
        "dua": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
        "translation": " My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.",
        "reference": "Surah Al-Aḥqaf (46:15)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4525.mp3"
        ]
    },
    {
        "id": "2",
        "dua": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ",
        "translation": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are full of kindness and Merciful.",
        "reference": "Surah Al-Ḥashr (59:10)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/5136.mp3"
        ]
    },
    {
        "id": "3",
        "dua": "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "translation": "Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
        "reference": "Surah Al-Baqarah (2:286)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/293.mp3"
        ]
    },
    {
        "id": "4",
        "dua": "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
        "translation": "Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bountiful Giver.",
        "reference": "Surah Aal-'Imran (3:8)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/301.mp3"
        ]
    },
    {
        "id": "5",
        "dua": "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء",
        "translation": "O my Lord! Grant unto me from You a progeny that is pure: for You are the one who hears (our) prayers!",
        "reference": "Surah Aal-'Imran (3:38)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/331.mp3"
        ]
    },
    {
        "id": "6",
        "dua": "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "translation": "Our Lord! Forgive us our sins and our transgressions, establish our feet firmly, and give us victory over the disbelieving folk.",
        "reference": "Surah Aal-'Imran (3:147)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/440.mp3"
        ]
    },
    {
        "id": "7",
        "dua": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ",
        "translation": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. So forgive us our sins, Our Lord, and remove from us our misdeeds and and make us die the death of the righteous.",
        "reference": "Surah Aal-'Imran (3:193)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/486.mp3"
        ]
    },
    {
        "id": "8",
        "dua": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "translation": "Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.",
        "reference": "Surah Al-A'raf (7:23)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/977.mp3"
        ]
    },
    {
        "id": "9",
        "dua": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي  يَفْقَهُوا قَوْلِي",
        "translation": "O my Lord! Widen for me my bossom (grant me self-confidence, contentment, and boldness); And ease my task for me; And make loose the knot (i.e. the defect restricting speech) from my tongue; So they may understand what I say",
        "reference": "Surah TaHa (20:25-28) ",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2373.mp3",
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2376.mp3"
        ]
    },
    {
        "id": "10",
        "dua": "رَّبِّ زِدْنِي عِلْمًا",
        "translation": "My Lord! Increase me in knowledge.",
        "reference": "Surah TaHa (20:114)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2462.mp3"
        ]
    },
    {
        "id": "11",
        "dua": "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
        "translation": "Indeed, adversity has seized me, and you are the Most Merciful of all those who show mercy",
        "reference": "Surah  Al-'Anbyaa' (21:83) ",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2566.mp3"
        ]
    },
    {
        "id": "12",
        "dua": "لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
        "translation": "There is no deity worthy of worship but You, glory to be to You, Indeed, I have been of the wrongdoers.",
        "reference": "Surah  Al-'Anbyaa' (21:87)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2570.mp3"
        ]
    },
    {
        "id": "13",
        "dua": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
        "translation": "Our Lord! pour out patience on us, and cause us to die as Muslims.",
        "reference": "Surah Al-A'raf (7:126)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1080.mp3"
        ]
    },
    {
        "id": "16",
        "dua": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرً",
        "translation": "My Lord, have mercy upon them as they brought me up [when I was] a child.",
        "reference": "Surah Al-Israa' (17:24)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2053.mp3"
        ]
    },
    {
        "id": "17",
        "dua": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدً",
        "translation": "Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!",
        "reference": "Surah Al-Kahf (18:10)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2150.mp3"
        ]
    },
    {
        "id": "18",
        "dua": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
        "translation": "And Zachariah, when he cried unto his Lord: My Lord! Leave me not childless, though You are the the Best of inheritors.",
        "reference": "Surah  Al-'Anbyaa' (21:89)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2572.mp3"
        ]
    },
    {
        "id": "19",
        "dua": "رَّبِّ أَنزِلْنِي مُنزَلًا مُّبَارَكًا وَأَنتَ خَيْرُ الْمُنزِلِينَ",
        "translation": "My Lord, let me land at a blessed landing place, and You are the best to accommodate [us].",
        "reference": " Surah Al-Mu'minoon (23:29)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2702.mp3"
        ]
    },
    {
        "id": "20",
        "dua": "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
        "translation": "My Lord! I seek refuge with You from the whisperings (suggestions) of the Shayatin (devils), And I seek refuge with You, My Lord! lest they may attend (or come near) me.",
        "reference": "Surah Al-Mu'minoon (23:97-98)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2770.mp3",
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2771.mp3"
        ]
    },
    {
        "id": "21",
        "dua": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ",
        "translation": "Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!",
        "reference": "Surah Al-Mu'minoon (23:109)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2782.mp3"
        ]
    },
    {
        "id": "22",
        "dua": "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ",
        "translation": "My Lord! Forgive and have mercy, for You are the Best of those who show mercy!",
        "reference": "Surah Al-Mu'minoon (23:118)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2791.mp3"
        ]
    },
    {
        "id": "23",
        "dua": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
        "translation": "Our Lord! Avert from us the torment of Hell. Verily! Its torment is ever an inseparable, permanent punishment.",
        "reference": "Surah Al-Furqaan (25:65)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2920.mp3"
        ]
    },
    {
        "id": "24",
        "dua": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
        "translation": "Our Lord! Bestow on us from our wives and our offspring who will be the comfort of our eyes, and make us leaders for those who are pious(Muttaqun)",
        "reference": "Surah Al-Furqaan (25:74)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2929.mp3"
        ]
    },
    {
        "id": "25",
        "dua": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
        "translation": "My Lord, indeed I have wronged myself, so forgive me,",
        "reference": "Surah Al-Qasas (28:16)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3268.mp3"
        ]
    },
    {
        "id": "27",
        "dua": "وَإِذْ يَرْفَعُ إِبْرَٰهِۦمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيم",
        "translation": "And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], \"Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.",
        "reference": "Surah Al-Baqara (2:127)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/134.mp3"
        ]
    },
    {
        "id": "28",
        "dua": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
        "translation": "Our Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.",
        "reference": "Surah Al-Baqara (2:128)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/135.mp3"
        ]
    },
    {
        "id": "29",
        "dua": "رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةً وَفِى ٱلْءَاخِرَةِ حَسَنَةً وَقِنَا عَذَابَ ٱلنَّارُ",
        "translation": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
        "reference": "Surah Al-Baqara (2:201)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/208.mp3"
        ]
    },
    {
        "id": "30",
        "dua": "رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينُ",
        "translation": "Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.",
        "reference": "Surah Al-Baqara (2:250)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/257.mp3"
        ]
    },
    {
        "id": "31",
        "dua": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادُ",
        "translation": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"",
        "reference": "Surah Aal-'Imran (3:9)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/302.mp3"
        ]
    },
    {
        "id": "32",
        "dua": "رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارُِ",
        "translation": "Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,",
        "reference": "Surah Aal-'Imran (3:16)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/309.mp3"
        ]
    },
    {
        "id": "33",
        "dua": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّٰهِدِينَُِ",
        "translation": "Our Lord, we have believed in what You revealed and have followed the messenger Jesus, so register us among the witnesses [to truth].\"",
        "reference": "Surah Aal-'Imran (3:53)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/346.mp3"
        ]
    },
    {
        "id": "34",
        "dua": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَٰطِلًا سُبْحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارَُِ",
        "translation": "Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.",
        "reference": "Surah Aal-'Imran (3:191)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/484.mp3"
        ]
    },
    {
        "id": "35",
        "dua": "رَبَّنَآ إِنَّكَ مَن تُدْخِلِ ٱلنَّارَ فَقَدْ أَخْزَيْتَهُۥ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارَُِ",
        "translation": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.",
        "reference": "Surah Aal-'Imran (3:192)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/485.mp3"
        ]
    },
    {
        "id": "36",
        "dua": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمَٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارَُِ",
        "translation": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
        "reference": "Surah Aal-'Imran (3:193)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/486.mp3"
        ]
    },
    {
        "id": "37",
        "dua": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَُِ",
        "translation": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.",
        "reference": "Surah Aal-'Imran (3:194)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/487.mp3"
        ]
    },
    {
        "id": "38",
        "dua": "رَبَّنَآ ءَامَنَّا فَٱكْتُبْنَا مَعَ ٱلشَّٰهِدِينَُِ",
        "translation": "Our Lord, we have believed, so register us among the witnesses.",
        "reference": "Surah Al-Ma'ida (5:83)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/752.mp3"
        ]
    },
    {
        "id": "39",
        "dua": "رَبَّنَآ أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَءَاخِرِنَا وَءَايَةً مِّنكَ وَٱرْزُقْنَا وَأَنتَ خَيْرُ ٱلرَّٰزِقِين",
        "translation": "O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers.",
        "reference": "Surah Al-Ma'ida (5:114)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/783.mp3"
        ]
    },
    {
        "id": "40",
        "dua": "رَبَّنَا لَا تَجْعَلْنَا مَعَ ٱلْقَوْمِ ٱلظَّٰلِمِين",
        "translation": "Our Lord, do not place us with the wrongdoing people.",
        "reference": "Surah Al-A'raf(7:47)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1001.mp3"
        ]
    },
    {
        "id": "41",
        "dua": "رَبَّنَا ٱفْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِٱلْحَقِّ وَأَنتَ خَيْرُ ٱلْفَٰتِحِين",
        "translation": "Our Lord, decide between us and our people in truth, and You are the best of those who give decision.",
        "reference": "Surah Al-A'raf(7:89)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1043.mp3"
        ]
    },
    {
        "id": "42",
        "dua": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ ٱلظَّٰلِمِين",
        "translation": "Our Lord, make us not [objects of] trial for the wrongdoing people",
        "reference": "Surah Yunus (10:85)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1449.mp3"
        ]
    },
    {
        "id": "43",
        "dua": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
        "translation": "And save us by Your mercy from the disbelieving people.",
        "reference": "Surah Yunus (10:86)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1450.mp3"
        ]
    },
    {
        "id": "44",
        "dua": "رَبَّنَآ إِنَّكَ تَعْلَمُ مَا نُخْفِى وَمَا نُعْلِنُ وَمَا يَخْفَىٰ عَلَى ٱللَّهِ مِن شَىْءٍ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءَ",
        "translation": "Our Lord, indeed You know what we conceal and what we declare, and nothing is hidden from Allah on the earth or in the heaven.",
        "reference": "Surah Ibrahim (14:38)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1788.mp3"
        ]
    },
    {
        "id": "14",
        "dua": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء",
        "translation": "O my Lord! make me one who establishes Salah (regular Prayer), and also (raise such) among my offspring O our Lord! and accept my Prayer.",
        "reference": "Surah Ibrahim (14:40)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1790.mp3"
        ]
    },
    {
        "id": "15",
        "dua": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
        "translation": "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.",
        "reference": " Surah Ibrahim (14:41)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1791.mp3"
        ]
    },
    {
        "id": "45",
        "dua": "رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
        "translation": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.",
        "reference": " Surah Kahf (18:10)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2150.mp3"
        ]
    },
    {
        "id": "46",
        "dua": "رَبَّنَآ إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَآ أَوْ أَن يَطْغَىٰ",
        "translation": "Our Lord, indeed we are afraid that he will hasten [punishment] against us or that he will transgress.",
        "reference": " Surah Taa-Haa (20:45)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2393.mp3"
        ]
    },
    {
        "id": "47",
        "dua": "إِنَّهَا سَآءَتْ مُسْتَقَرًّا وَمُقَامًا",
        "translation": "Indeed, it is evil as a settlement and residence.",
        "reference": "Surah Al-Furqaan (25:66)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2921.mp3"
        ]
    },
    {
        "id": "47",
        "dua": "رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍ فَقِير",
        "translation": "My Lord, indeed I am, for whatever good You would send down to me, in need.",
        "reference": "Surah Al-Qasas (28:24)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3276.mp3"
        ]
    },
    {
        "id": "48",
        "dua": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيم",
        "translation": "Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.",
        "reference": "Surah Ghafir (40:7)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4140.mp3"
        ]
    },
    {
        "id": "49",
        "dua": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُم وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيم",
        "translation": "Our Lord! And make them enter the Gardens of Eden [Paradise] which you have promised them, whoever was righteous among their fathers, their spouses and their offspring.  Indeed, You are the All-Mighty, the All-Wise.",
        "reference": "Surah Ghafir (40:8)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4141.mp3"
        ]
    },
    {
        "id": "26",
        "dua": "وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيم",
        "translation": "And protect them from [the consequences of]their sins,  And he who You protect from [the consequences of their sins] that Day - You will have given him mercy. And that is the great success.",
        "reference": "Surah Ghafir (40:9)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4142.mp3"
        ]
    },
    {
        "id": "50",
        "dua": "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ ٱلْمَصِير",
        "translation": "Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.",
        "reference": "Surah Al-Mumtahinah (60:4)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/5154.mp3"
        ]
    },
    {
        "id": "51",
        "dua": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟ وَٱغْفِرْ لَنَا رَبَّنَآ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيم",
        "translation": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.",
        "reference": "Surah Al-Mumtahinah (60:4)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/5154.mp3"
        ]
    },
    {
        "id": "52",
        "dua": "رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِير",
        "translation": "Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.",
        "reference": "Surah At-Tahrim (66:8)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/5237.mp3"
        ]
    }
]